In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
   ....:                    "key2" : pd.Series([1, 2, 1, 2, 1, None, 1],
   ....:                                       dtype="Int64"),
   ....:                    "data1" : np.random.standard_normal(7),
   ....:                    "data2" : np.random.standard_normal(7)})
df

   key1  key2     data1     data2
0     a     1 -1.615107 -0.941220
1     a     2 -0.061920  1.095703
2  None     1 -0.393483 -0.135796
3     b     2 -0.677330 -1.014566
4     b     1 -0.418941  0.366511
5     a  <NA>  0.092732  0.788882
6  None     1 -0.369214  0.040118

In [3]:
grouped = df["data1"].groupby(df["key1"])

In [4]:
grouped.mean()

key1
a   -0.528098
b   -0.548136
Name: data1, dtype: float64

In [5]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()
means

key1  key2
a     1      -1.615107
      2      -0.061920
b     1      -0.418941
      2      -0.677330
Name: data1, dtype: float64

In [6]:
means.unstack()

key2         1        2
key1
a    -1.615107 -0.06192
b    -0.418941 -0.67733

In [7]:
df.groupby("key1").mean()

      key2     data1     data2
key1
a      1.5 -0.528098  0.314455
b      1.5 -0.548136 -0.324027

In [8]:
df.groupby("key2").mean(numeric_only=True)

         data1     data2
key2
1    -0.699186 -0.167597
2    -0.369625  0.040569

In [9]:
df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    1    -1.615107 -0.941220
     2    -0.061920  1.095703
b    1    -0.418941  0.366511
     2    -0.677330 -1.014566

In [10]:
df.groupby("key1", dropna=False).size()

key1
a      3
b      2
NaN    2
dtype: int64

In [11]:
df.groupby("key1").count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

In [12]:
for name, group in df.groupby("key1"):
   ....:     print(name)
   ....:     print(group)

a
  key1  key2     data1     data2
0    a     1 -1.615107 -0.941220
1    a     2 -0.061920  1.095703
5    a  <NA>  0.092732  0.788882
b
  key1  key2     data1     data2
3    b     2 -0.677330 -1.014566
4    b     1 -0.418941  0.366511

In [13]:
for (k1, k2), group in df.groupby(["key1", "key2"]):
   ....:     print((k1, k2))
   ....:     print(group)

('a', 1)
  key1  key2     data1    data2
0    a     1 -1.615107 -0.94122
('a', 2)
  key1  key2    data1     data2
1    a     2 -0.06192  1.095703
('b', 1)
  key1  key2     data1     data2
4    b     1 -0.418941  0.366511
('b', 2)
  key1  key2    data1     data2
3    b     2 -0.67733 -1.014566

In [14]:
df.groupby(["key1", "key2"])[["data2"]].mean()

              data2
key1 key2
a    1    -0.941220
     2     1.095703
b    1     0.366511
     2    -1.014566

In [15]:
people = pd.DataFrame(np.random.standard_normal((5, 5)),
   ....:                       columns=["a", "b", "c", "d", "e"],
   ....:                       index=["Joe", "Steve", "Wanda", "Jill", "Trey"])

In [16]:
 people.iloc[2:3, [1, 2]] = np.nan

In [17]:
mapping = {"a": "red", "b": "red", "c": "blue",
   ....:            "d": "blue", "e": "red", "f" : "orange"}

In [19]:
by_column = people.groupby(mapping, axis="columns")

In [20]:
by_column.sum()

           blue       red
Joe   -2.613782  0.510425
Steve -2.599694 -0.791544
Wanda -1.689815  1.619041
Jill   2.037407 -0.979743
Trey  -1.250505 -0.752676

In [21]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.255672 -0.525685 -1.275269 -1.338513  0.780437
4 -0.707318  0.348778  0.070623  0.716280 -1.373879
5 -0.219672  0.037424 -0.337596 -3.951914  1.009746

In [22]:
columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],
   ....:                                     [1, 3, 5, 1, 3]],
   ....:                                     names=["cty", "tenor"])

In [23]:
hier_df = pd.DataFrame(np.random.standard_normal((4, 5)), columns=columns)

In [24]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.908642 -0.645856  1.738877  1.347457  1.527659
1      1.647574  0.560613  0.815356  0.741006 -0.230062
2     -0.116764  1.124767 -0.293836  1.243092  0.812316
3     -1.495990 -0.137272 -1.211514  0.418346  0.798146

In [25]:
hier_df.groupby(level="cty", axis="columns").count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [26]:
grouped = df.groupby("key1")
grouped["data1"].nsmallest(2)

key1
a     0   -1.615107
      1   -0.061920
b     3   -0.677330
      4   -0.418941
Name: data1, dtype: float64

In [27]:
def peak_to_peak(arr):
   ....:     return arr.max() - arr.min()

In [28]:
grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  1.707839  2.036923
b        1  0.258390  1.381077

In [29]:
tips = pd.read_csv("examples/tips.csv")

In [30]:
 tips["tip_pct"] = tips["tip"] / tips["total_bill"]

In [31]:
tips

     total_bill   tip smoker   day    time  size   tip_pct
0         16.99  1.01     No   Sun  Dinner     2  0.059447
1         10.34  1.66     No   Sun  Dinner     3  0.160542
2         21.01  3.50     No   Sun  Dinner     3  0.166587
3         23.68  3.31     No   Sun  Dinner     2  0.139780
4         24.59  3.61     No   Sun  Dinner     4  0.146808
..          ...   ...    ...   ...     ...   ...       ...
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

[244 rows x 7 columns]

In [32]:
grouped = tips.groupby(["day", "smoker"])
grouped_pct = grouped["tip_pct"]
grouped_pct.agg("mean")

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [33]:
grouped_pct.agg(["mean", "std", peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [34]:
grouped_pct.agg([("average", "mean"), ("stdev", np.std)])

              average     stdev
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [35]:
functions = ["count", "mean", "max"]

In [36]:
result = grouped[["tip_pct", "total_bill"]].agg(functions)
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [37]:
grouped.agg({"tip_pct" : ["min", "max", "mean", "std"],
   ....:              "size" : "sum"})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [38]:
def top(df, n=5, column="tip_pct"):
   ....:     return df.sort_values(column, ascending=False)[:n]

In [39]:
 top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
232       11.61  3.39     No  Sat  Dinner     2  0.291990
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525

In [40]:
tips.groupby("smoker").apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     232       11.61  3.39     No   Sat  Dinner     2  0.291990
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       88        24.71  5.85     No  Thur   Lunch     2  0.236746
Yes    172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [41]:
tips.groupby(["smoker", "day"]).apply(top, n=1, column="total_bill")

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [42]:
tips.groupby("smoker", group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
232       11.61  3.39     No   Sat  Dinner     2  0.291990
149        7.51  2.00     No  Thur   Lunch     2  0.266312
51        10.29  2.60     No   Sun  Dinner     2  0.252672
185       20.69  5.00     No   Sun  Dinner     5  0.241663
88        24.71  5.85     No  Thur   Lunch     2  0.236746
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [47]:
frame = pd.DataFrame({"data1": np.random.standard_normal(1000),
   ....:                       "data2": np.random.standard_normal(1000)})

In [48]:
quartiles = pd.cut(frame["data1"], 4)

In [49]:
def get_stats(group):
   ....:     return pd.DataFrame(
   ....:         {"min": group.min(), "max": group.max(),
   ....:         "count": group.count(), "mean": group.mean()}
   ....:     )

In [52]:
frame

        data1     data2
0   -0.690205  0.426609
1   -2.520314  2.473573
2   -0.374353 -0.345312
3   -0.657264 -1.030162
4   -0.354701 -1.651117
..        ...       ...
995  0.289160  2.202775
996  0.583959  0.285591
997  0.327153  1.032623
998  0.277032 -0.958341
999  0.943690  1.224735

[1000 rows x 2 columns]

In [50]:
grouped = frame.groupby(quartiles)
group.apply(get_stats)

TypeError: Could not convert b to numeric

In [53]:
grouped.agg(["min", "max", "count", "mean"])

                     data1                               data2            \
                       min       max count      mean       min       max
data1
(-3.006, -1.432] -2.999363 -1.435778    71 -1.790189 -2.201583  2.473573
(-1.432, 0.135]  -1.430394  0.134570   472 -0.484759 -3.795103  2.787661
(0.135, 1.702]    0.138442  1.687740   393  0.769121 -3.096504  2.664363
(1.702, 3.269]    1.706920  3.268787    64  2.115793 -2.389478  2.232515


                 count      mean
data1
(-3.006, -1.432]    71  0.019236
(-1.432, 0.135]    472 -0.031761
(0.135, 1.702]     393 -0.032975
(1.702, 3.269]      64  0.214848

In [54]:
s = pd.Series(np.random.standard_normal(6))

In [55]:
s[::2] = np.nan

In [56]:
s.fillna(s.mean())

0    0.206061
1    0.881553
2    0.206061
3   -0.875769
4    0.206061
5    0.612398
dtype: float64

In [57]:
states = ["Ohio", "New York", "Vermont", "Florida",
   .....:           "Oregon", "Nevada", "California", "Idaho"]
group_key = ["East", "East", "East", "East",
   .....:              "West", "West", "West", "West"]

In [58]:
data = pd.Series(np.random.standard_normal(8), index=states)
data

Ohio          0.459086
New York     -1.086032
Vermont       0.270950
Florida       0.959164
Oregon       -1.310737
Nevada       -0.688076
California    1.393932
Idaho         1.074995
dtype: float64

In [59]:
data[["Vermont", "Nevada", "Idaho"]] = np.nan

In [60]:
data.groupby(group_key).size()

East    4
West    4
dtype: int64

In [61]:
def fill_mean(group):
   .....:     return group.fillna(group.mean())

In [62]:
data.groupby(group_key).apply(fill_mean)

East  Ohio          0.459086
      New York     -1.086032
      Vermont       0.110739
      Florida       0.959164
West  Oregon       -1.310737
      Nevada        0.041597
      California    1.393932
      Idaho         0.041597
dtype: float64

In [63]:
suits = ["H", "S", "C", "D"]  # Hearts, Spades, Clubs, Diamonds
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ["A"] + list(range(2, 11)) + ["J", "K", "Q"]
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

In [64]:
deck.head(13)

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [65]:
def draw(deck, n=5):
   .....:     return deck.sample(n)

In [66]:
def get_suit(card):
   .....:     # last letter is suit
   .....:     return card[-1]

In [67]:
deck.groupby(get_suit).apply(draw, n=2)

C  2C      2
   9C      9
D  2D      2
   3D      3
H  5H      5
   10H    10
S  2S      2
   4S      4
dtype: int64

In [68]:
df = pd.DataFrame({"category": ["a", "a", "a", "a",
   .....:                                 "b", "b", "b", "b"],
   .....:                    "data": np.random.standard_normal(8),
   .....:                    "weights": np.random.uniform(size=8)})

In [69]:
grouped = df.groupby("category")

In [70]:
def get_wavg(group):
   .....:     return np.average(group["data"], weights=group["weights"])

In [71]:
grouped.apply(get_wavg)

category
a   -0.256911
b    0.278946
dtype: float64

In [72]:
df = pd.DataFrame({'key': ['a', 'b', 'c'] * 4,
   .....:                    'value': np.arange(12.)})

In [73]:
g = df.groupby('key')['value']
g.mean()

key
a    4.5
b    5.5
c    6.5
Name: value, dtype: float64

In [74]:
def get_mean(group):
   .....:     return group.mean()

In [75]:
g.transform(get_mean)

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [76]:
g.transform('mean')

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [77]:
normalized = (df['value'] - g.transform('mean')) / g.transform('std')

In [78]:
tips.pivot_table(index=["day", "smoker"],
   .....:                  values=["size", "tip", "tip_pct", "total_bill"])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [79]:
tips.pivot_table(index=["time", "day"], columns="smoker",
   .....:                  values=["tip_pct", "size"])

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [80]:
tips.pivot_table(index=["time", "size", "smoker"], columns="day",
   .....:                  values="tip_pct", fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [81]:
from io import StringIO
data = """Sample  Nationality  Handedness
1   USA  Right-handed
2   Japan    Left-handed
3   USA  Right-handed
4   Japan    Right-handed
5   Japan    Left-handed
6   Japan    Right-handed
7   USA  Right-handed
8   USA  Left-handed
9   Japan    Right-handed
10  USA  Right-handed"""

data = pd.read_table(StringIO(data), sep="\s+")

In [82]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [83]:
pd.crosstab(data["Nationality"], data["Handedness"], margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10